БухЭксп/InformationRegisters/CW_ПрогнозОплатыПлановыхСтатейБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПрогнозОплатыПлановыхСтатейБюджета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрогнозДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПлановыеСтатьиЗатратИДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПрогнозОплатыПлановыхСтатейБюджета/Ext/ManagerModule.bsl
Функция ПолучитьПрогнозОплаты(СтатьяБюджета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ПрогнозОплатыПлановыхСтатейБюджета.ПрогнозДата КАК ПрогнозДата
	               |ИЗ
	               |	РегистрСведений.CW_ПрогнозОплатыПлановыхСтатейБюджета КАК CW_ПрогнозОплатыПлановыхСтатейБюджета
	               |ГДЕ
	               |	CW_ПрогнозОплатыПлановыхСтатейБюджета.СтатьяБюджета = &СтатьяБюджета";  
	
	Запрос.УстановитьПараметр("СтатьяБюджета", СтатьяБюджета);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПрогнозДата;
	КонецЕсли;
	
	Возврат Дата(1,1,1);
	
КонецФункции     

Процедура ЗаписатьПрогнозОплаты(СтатьяБюджета, ПрогнозДата) Экспорт 
	
	Запись = РегистрыСведений.CW_ПрогнозОплатыПлановыхСтатейБюджета.СоздатьМенеджерЗаписи();
	Запись.СтатьяБюджета 	= СтатьяБюджета; 
	Запись.ПрогнозДата 		= ПрогнозДата; 
	Запись.Записать(Истина);
	
КонецПроцедуры
